"""
3. Написать функцию thesaurus(), принимающую в качестве аргументов имена сотрудников и возвращающую словарь,
в котором ключи — первые буквы имён, а значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
Например:
#>>>  thesaurus("Иван", "Мария", "Петр", "Илья")
{
    "И": ["Иван", "Илья"],
    "М": ["Мария"], "П": ["Петр"]
}
Подумайте: полезен ли будет вам оператор распаковки?
Как поступить, если потребуется сортировка по ключам? Можно ли использовать словарь в этом случае?
"""


def thesaurus(*args) -> dict:
    name_dict = {}
    for name in args:
        key = name[0].capitalize()
        if key not in name_dict:
            name_dict[key] = []
        name_dict[key].append(name)
    return name_dict


print(thesaurus("Иван", "Мария", "Петр", "Илья"))
