"""
Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
Проверить работу исключения на реальном примере.
Запрашивать у пользователя данные и заполнять список необходимо только числами.
Класс-исключение должен контролировать типы данных элементов списка.
Примечание: длина списка не фиксирована.
Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу скрипта, введя, например, команду «stop».
При этом скрипт завершается, сформированный список с числами выводится на экран.
Подсказка: для этого задания примем, что пользователь может вводить только числа и строки.
Во время ввода пользователем очередного элемента необходимо реализовать проверку типа элемента.
Вносить его в список, только если введено число.
Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
При этом работа скрипта не должна завершаться.
"""

class Error:
    def __init__(self, *args):
        self.numbers_list = []

    def user_input(self):
        while True:
            try:
                meaning = int(input("Введите число: "))
                self.numbers_list.append(meaning)
                print(f'Текущий список {self.numbers_list} \n')
            except:
                print('Недопустимое значение - В список попадают только числа')
                yes_or_no = input('Попробовать ещё раз? Y/N: ')
                if yes_or_no == 'Y' or yes_or_no == 'y':
                    meaning = int(input("Введите число: "))
                elif yes_or_no == 'N' or yes_or_no == 'n':
                    return f'Вы вышли. Текущий список {self.numbers_list}'
                else:
                    meaning = int(input("Введите число: "))

try_except = Error(1)
print(try_except.user_input())



