from turtle import width
"""Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками 
(добавить кавычку до и кавычку после элемента списка, являющегося числом) и 
дополнить нулём до двух целочисленных разрядов. Сформировать из обработанного списка строку:
в "05" часов "17" минут температура воздуха была "+05" градусов

(вместо задачи 2) Решить задачу 2 не создавая новый список (как говорят, in place).
 Эта задача намного серьёзнее, чем может сначала показаться.
"""
""" Новый список я не создавал, получается ещё и 3 задание сделано"""

my_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']

for (index, i) in enumerate(my_list):
    if i.isalpha() == False:
        if len(i) >= 2:
            my_list[index] = f'"{i}"'
        else:
            my_list[index] = f'"{"0" + i}"'

print(" ".join(my_list))
