
"""
Написать скрипт, который выводит статистику для заданной папки в виде словаря, в котором
ключи — верхняя граница размера файла (пусть будет кратна 10), а значения — общее
количество файлов (в том числе и в подпапках), размер которых не превышает этой границы,
но больше предыдущей (начинаем с 0), например:
{
100: 15,
1000: 3,
10000: 7,
100000: 2
}
Тут 15 файлов размером не более 100 байт; 3 файла больше 100 и не больше 1000 байт...
"""

import os
files = []  # в список будем записывать размер файлов

for r, d, f in os.walk('./'):  # os.walk('./') - ходим по всей дериктории
    for file in f:
        file_path = os.path.join(r, file)
        files.append(os.stat(file_path).st_size)
        # Записываем файлв в files, stat - возвращает файл, st_size - возвращает размер
max_size = max(files)

i = 1
my_dict = {}

for _ in range(len(str(max_size))):
    i *= 10
    my_dict[i] = 0
    # ходим по max_size и заисывем в словарь кллючи умножая на дсять после каждой цифры
    #  в итоге my_dict = {10: 0, 100: 0, 1000: 0, 10000: 0, 100000: 0}
    # размер max_size = 99903
print(my_dict)
for file in files:
    len_file = len(str(file))
    my_dict[10 ** len_file] += 1
    # Ходим по списку, возводя длину элемента в 10 степень и получаем соответствие с ключём словаря
    # после чего добавляем к значению словаря +1
print(my_dict)

# сложно, почему так сложно













